# Roughness Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSection..::..Roughness Property
MEPSection Class See Also
---
The roughness of the section.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double Roughness { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Roughness As Double
	Get
```

Visual C++
---
```text
public:
property double Roughness {
	double get ();
}
```

# Remarks
In one section, all section members have same roughness. Default unit is Decimal feet. For Duct, unit type is UT_HVAC_Roughness. For Pipe, unit type is UT_Piping_Roughness
# See Also
MEPSection Class
Autodesk.Revit.DB.Mechanical Namespace